Ran Plan for project: `DevOps-legacy-production` dir: `legacy-production/DevOps` workspace: `default`

<details><summary>Show Output</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+ create

Terraform will perform the following actions:

  # module.pipeline_regular_prod_monitor_role.aws_iam_role.this[0] will be created
+ resource "aws_iam_role" "this" {
+       arn                   = (known after apply)
+       assume_role_policy    = jsonencode(
            {
+               Statement = [
+                   {
+                       Action    = [
+                           "sts:TagSession",
+                           "sts:AssumeRoleWithWebIdentity",
+                           "sts:AssumeRole",
                        ]
+                       Condition = {
+                           StringEquals = {
+                               "token.actions.githubusercontent.com:aud" = "sts.amazonaws.com"
                            }
+                           StringLike   = {
+                               "token.actions.githubusercontent.com:sub" = "repo:plentiau/DevOps:*"
                            }
                        }
+                       Effect    = "Allow"
+                       Principal = {
+                           AWS       = []
+                           Federated = "arn:aws:iam::519527725796:oidc-provider/token.actions.githubusercontent.com"
+                           Service   = []
                        }
                    },
                ]
+               Version   = "2012-10-17"
            }
        )
+       create_date           = (known after apply)
+       force_detach_policies = false
+       id                    = (known after apply)
+       managed_policy_arns   = (known after apply)
+       max_session_duration  = 3600
+       name                  = "pipeline-regular-prod-monitor-role"
+       name_prefix           = (known after apply)
+       path                  = "/"
+       tags_all              = {
+           "account_name" = "legacy-production"
+           "managed_by"   = "terraform"
+           "path"         = "legacy-production/DevOps"
+           "repo"         = "terraform-plenti-iam"
        }
+       unique_id             = (known after apply)

+       inline_policy (known after apply)
    }

  # module.pipeline_regular_prod_monitor_role.aws_iam_role_policy.ssm[0] will be created
+ resource "aws_iam_role_policy" "ssm" {
+       id          = (known after apply)
+       name        = "SSM"
+       name_prefix = (known after apply)
+       policy      = jsonencode(
            {
+               Statement = [
+                   {
+                       Action   = [
+                           "ssm:GetParametersByPath",
+                           "ssm:GetParameters",
+                           "ssm:GetParameterHistory",
+                           "ssm:GetParameter",
                        ]
+                       Effect   = "Allow"
+                       Resource = [
+                           "arn:aws:ssm:ap-southeast-2:519527725796:parameter/password_production_monitor",
+                           "arn:aws:ssm:ap-southeast-2:519527725796:parameter/devops/*",
+                           "arn:aws:ssm:ap-southeast-2:519527725796:parameter/aurora_password_dbreadonly",
                        ]
                    },
                ]
+               Version   = "2012-10-17"
            }
        )
+       role        = "pipeline-regular-prod-monitor-role"
    }

  # module.pipeline_regular_uat_monitor_role.aws_iam_role.this[0] will be created
+ resource "aws_iam_role" "this" {
+       arn                   = (known after apply)
+       assume_role_policy    = jsonencode(
            {
+               Statement = [
+                   {
+                       Action    = [
+                           "sts:TagSession",
+                           "sts:AssumeRoleWithWebIdentity",
+                           "sts:AssumeRole",
                        ]
+                       Condition = {
+                           StringEquals = {
+                               "token.actions.githubusercontent.com:aud" = "sts.amazonaws.com"
                            }
+                           StringLike   = {
+                               "token.actions.githubusercontent.com:sub" = "repo:plentiau/DevOps:*"
                            }
                        }
+                       Effect    = "Allow"
+                       Principal = {
+                           AWS       = []
+                           Federated = "arn:aws:iam::519527725796:oidc-provider/token.actions.githubusercontent.com"
+                           Service   = []
                        }
                    },
                ]
+               Version   = "2012-10-17"
            }
        )
+       create_date           = (known after apply)
+       force_detach_policies = false
+       id                    = (known after apply)
+       managed_policy_arns   = (known after apply)
+       max_session_duration  = 3600
+       name                  = "pipeline-regular-uat-monitor-role"
+       name_prefix           = (known after apply)
+       path                  = "/"
+       tags_all              = {
+           "account_name" = "legacy-production"
+           "managed_by"   = "terraform"
+           "path"         = "legacy-production/DevOps"
+           "repo"         = "terraform-plenti-iam"
        }
+       unique_id             = (known after apply)

+       inline_policy (known after apply)
    }

  # module.pipeline_regular_uat_monitor_role.aws_iam_role_policy.ssm[0] will be created
+ resource "aws_iam_role_policy" "ssm" {
+       id          = (known after apply)
+       name        = "SSM"
+       name_prefix = (known after apply)
+       policy      = jsonencode(
            {
+               Statement = [
+                   {
+                       Action   = [
+                           "ssm:GetParametersByPath",
+                           "ssm:GetParameters",
+                           "ssm:GetParameterHistory",
+                           "ssm:GetParameter",
                        ]
+                       Effect   = "Allow"
+                       Resource = [
+                           "arn:aws:ssm:ap-southeast-2:519527725796:parameter/password_dbscripts_uat",
+                           "arn:aws:ssm:ap-southeast-2:519527725796:parameter/devops/*",
                        ]
                    },
                ]
+               Version   = "2012-10-17"
            }
        )
+       role        = "pipeline-regular-uat-monitor-role"
    }

Plan: 4 to add, 0 to change, 0 to destroy.

Changes to Outputs:
+ pipeline_regular_prod_monitor_role_arn           = (known after apply)
+ pipeline_regular_uat_monitor_role_arn            = (known after apply)
```
</details>

* :arrow_forward: To **apply** this plan, comment:
  ```shell
  atlantis apply -p DevOps-legacy-production
  ```
* :put_litter_in_its_place: To **delete** this plan and lock, click [here](https://atlantis.security.public.plenti.cloud/lock?id=plentiau%252Fterraform-plenti-iam%252Flegacy-production%252FDevOps%252Fdefault)
* :repeat: To **plan** this project again, comment:
  ```shell
  atlantis plan -p DevOps-legacy-production
  ```
Plan: 4 to add, 0 to change, 0 to destroy.

---
* :fast_forward: To **apply** all unapplied plans from this Pull Request, comment:
  ```shell
  atlantis apply
  ```
* :put_litter_in_its_place: To **delete** all plans and locks from this Pull Request, comment:
  ```shell
  atlantis unlock
  ```